app/controllers/songs_controller.rb

INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2016-02-07 22:39:04.964280"], ["updated_at", "2016-02-07 22:39:04.964280"]]
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2016-02-07 22:39:04.957665"], ["updated_at", "2016-02-07 22:39:04.957665"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ?  ORDER BY "artists"."id" ASC LIMIT 1  [["name", ".38 Special"]]
---
  def upload
    CSV.foreach(params["file"].path, headers: true) do |song|
      song = Song.create(title: song[0])
      song.artist_name = Artist.first_or_create(name: song[1])